package GameUI.Modules.Answer.Const
{
	public class AnswerConst
	{
		public static const DISPLAYANSWER:String = "DISPLAYANSWER";
//		public static var aGoodJob:Array = ["              <font color = '#00ff00'>适合你的门派是：全真</font> \n    你生性随和，但处事谨慎。你很容易认识朋友，但同时享受你的私人时间及独立生活。有时候，你会从人群中抽身而出，一个人静静地思考生活的意义。但你并不是一个爱孤独的人。你跟自己及这个世界都能够和陆共处，而你对现状亦非常满意。\n            <font color = '#fffe65'>和你最速配的门派是：丐帮</font>\n    飘渺若仙的全真弟子，至情重义。他们平时看似与世无争，潜心修炼，却会在最紧要关头仗剑而出，行侠仗义。对于全真教弟子而言，权利和富贵皆为虚空，他们终生清心寡欲，无所求也无所得。这样超凡脱俗的全真弟子，唯有丐帮弟子的泰然自若，才能与之相配。想来与丐帮弟子把酒言欢、仗剑江湖，对于全真弟子而言，不失为一次全新的悟道人生。",
//		"              <font color = '#00ff00'>适合你的门派是：丐帮</font>\n    你适应现实的能力很强，随遇而安，善于妥协。你看似粗枝大叶，其实甚为冷静理性，有过人一等的判断力。你的性格，恐怕是比较洒脱的那种，心态很宽松，以是否与自己投缘为标准来选择朋友。\n            <font color = '#fffe65'>和你最速配的门派是：全真</font>\n    游走在市井中的丐帮弟子，貌似油嘴滑舌、心口不一，其实他们有一颗路见不平、拔刀相助的热血快意心肠。他们随波逐流，却不顺从天意，在他们眼中永远看不到怯懦和屈服，为了自由和心中的正义，他们不惜抛下过往平静的生活，去追寻自己的梦想。丐帮弟子的这份豪爽，恰好是全真弟子所欠缺的一部分。",
//		"              <font color = '#00ff00'>适合你的门派是：少林</font>\n    你是个极端的人，不是完全投降，就是加足马力，拼搏到底。然而，拥有乐观和自信性格已是成功的开始。这样的人成熟度高，即使面对危险，也能顺便照顾别人。你作风自然，喜欢简单的东西，别人欣赏你脚踏实地，觉得你稳重，值得信赖。\n            <font color = '#fffe65'>和你最速配的门派是：峨眉</font>\n    一心向佛的少林弟子，他们天下正义的捍卫者，受到江湖之人的敬重和爱戴，守护天下苍生，是他们的职责所在。少林弟子从不为已，为了保护他人，他们竭尽全力，赴汤蹈火在所不惜。事实上一心想要皈依的少林弟子，与世尘缘并未了断。比起世间的险恶，单纯之人更能吸引他们，好似身处乱世却不染凡尘的峨眉。",
//		"              <font color = '#00ff00'>适合你的门派是：峨眉</font>\n    对于世间的事物，你习惯于乐观、单纯的心态来面对。但在复杂的社会生活里，人际关系往往令你最为烦恼。发生任何事情你都会自行处理与应对，但遇上危险时你的手法简单，成熟度平平，是不会想太多的人，有时矫枉过正。\n            <font color = '#fffe65'>和你最速配的门派是：少林</font>\n    心地善良的峨眉弟子，为造福天下众生而走遍世间。他们性格温和，为人处世恬淡，不为世事所动摇。冰清玉洁的峨眉弟子，仿佛天生就是为了救死扶伤而诞生于世。这样单纯的心，只要一旦认定了一个人，就不会放弃。为了爱可以放弃一切，就算落魄不堪，也绝不后悔。也许正是这样的执着，才能够打动少林派弟子磐石般的心。",
//		"              <font color = '#00ff00'>适合你的门派是：点苍</font>\n    你喜欢自由自在，无拘无束的生活。生命只能活一次，因此你尽量享受每一刻。你是一个感性的人。你拒绝只从一个严肃、理智的角度去理解事物，你的感觉亦十分重要。事实上，你觉得人生必需要有梦想才叫活得充实。\n            <font color = '#fffe65'>和你最速配的门派是：唐门</font>\n    点苍派位于苍山之上，积雪覆盖的雪山，不被世人所瞩目。他们只愿远离世间的是非，过着只羡鸳鸯不羡仙的生活。他们遵从师命，终日勤练箭术，日复一日不曾停歇。在点苍派弟子的心中，世界很简单，只有值得和不值得。所以当点苍派弟子遇见了唐门中人，单纯的心思经不起这么深城府的考验，只有陷落。",
//		"              <font color = '#00ff00'>适合你的门派：唐门</font>\n    你对于自己及四周的环境，能够比一般人控制得更好更彻底。你讨厌表面化及肤浅的东西，宁愿独自一人也不愿跟别人闲谈，但你跟朋友的关系却非常深入，这令你的心境保持和谐安逸。你不介意长时间独自一人，而且绝少会觉得沉闷。\n            <font color = '#fffe65'>和你最速配的门派是：点苍</font>\n    每一名合格的唐门之人，都是经历了最残酷的试炼。作为辅助的唐门虽然没有极大的战斗力，却拥有杀人于无形中的身法。他们从不畏惧危险，在压迫面前，他们会奋起反抗，令自己的对手望而生畏。拥有冷漠外表的唐门中人，隐藏着一颗炽热的心。当这份沉睡的情感邂逅了像冰雪一样无暇的点苍弟子时，或许在唐门弟子心中，会多了一份值得用生命去捍卫的东西。"
//]

/* 	国际化前
	public static var aGoodJob:Array = ["              <font color = '#00ff00'>适合你的门派是：全真</font> \n    你生性随和，但处事谨慎。你很容易认识朋友，但同时享受你的私人时间及独立生活。有时候，你会从人群中抽身而出，一个人静静地思考生活的意义。但你并不是一个爱孤独的人。你跟自己及这个世界都能够和陆共处，而你对现状亦非常满意。",
		"              <font color = '#00ff00'>适合你的门派是：丐帮</font>\n    你适应现实的能力很强，随遇而安，善于妥协。你看似粗枝大叶，其实甚为冷静理性，有过人一等的判断力。你的性格，恐怕是比较洒脱的那种，心态很宽松，以是否与自己投缘为标准来选择朋友。",
		"              <font color = '#00ff00'>适合你的门派是：少林</font>\n    你是个极端的人，不是完全投降，就是加足马力，拼搏到底。然而，拥有乐观和自信性格已是成功的开始。这样的人成熟度高，即使面对危险，也能顺便照顾别人。你作风自然，喜欢简单的东西，别人欣赏你脚踏实地，觉得你稳重，值得信赖。",
		"              <font color = '#00ff00'>适合你的门派是：峨眉</font>\n    对于世间的事物，你习惯于乐观、单纯的心态来面对。但在复杂的社会生活里，人际关系往往令你最为烦恼。发生任何事情你都会自行处理与应对，但遇上危险时你的手法简单，成熟度平平，是不会想太多的人，有时矫枉过正。",
		"              <font color = '#00ff00'>适合你的门派是：点苍</font>\n    你喜欢自由自在，无拘无束的生活。生命只能活一次，因此你尽量享受每一刻。你是一个感性的人。你拒绝只从一个严肃、理智的角度去理解事物，你的感觉亦十分重要。事实上，你觉得人生必需要有梦想才叫活得充实。",
		"              <font color = '#00ff00'>适合你的门派：唐门</font>\n    你对于自己及四周的环境，能够比一般人控制得更好更彻底。你讨厌表面化及肤浅的东西，宁愿独自一人也不愿跟别人闲谈，但你跟朋友的关系却非常深入，这令你的心境保持和谐安逸。你不介意长时间独自一人，而且绝少会觉得沉闷。 "
] */
		public static var aGoodJob:Array = [GameCommonData.wordDic[ "mod_ans_con_ans_AGoodJob1" ],
		GameCommonData.wordDic[ "mod_ans_con_ans_AGoodJob2" ],
		GameCommonData.wordDic[ "mod_ans_con_ans_AGoodJob3" ],
		GameCommonData.wordDic[ "mod_ans_con_ans_AGoodJob4" ],
		GameCommonData.wordDic[ "mod_ans_con_ans_AGoodJob5" ],
		GameCommonData.wordDic[ "mod_ans_con_ans_AGoodJob6" ] 
]
		public static const OPEN_MASTER_ANSWER_PANEL:String = "OPEN_MASTER_ANSWER_PANEL";			//打开师徒答题
		public static const CLOSE_MASTER_ANSWER_PANEL:String = "CLOSE_MASTER_ANSWER_PANEL";			//关闭师徒答题

	}
}